app/controllers/toys_controller.rb

  def show
    @toy = Toy.find(params[:id])
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 2]]